[
    {
      "id": "book1",
      "title": "[Tensor Calculus for Physics by Dwight E. Neuenschwander](https://www.amazon.ca/Tensor-Calculus-Physics-Concise-Guide/dp/1421415658)",
      "date": "Jan 2025",
      "subject": "Physics",
      "stars": "4.5",
      "review": "Neuenschwander presents an introduction to tensor calculus tailored to physics students. The treatment is clear and concise and accesible to non-mathematics students. This book includes many interesting derivations and anaolgies with the BraKet notation of Dirac, which is a welcomed addition to those familiar with quantum mechanics. This book dispels a lot of the seeming magic associated with defining tensors in terms of object that 'transform as tensors.' I highly recommend to anyone who has studied or used tensors but still remains unclear as to the mechanisms whereby they derive their usefullness.",
      "cover": "images/books/tcfp.jpeg"
    },
    {
      "id": "book2",
      "title": "[The Little Prince by Antoine de Saint-Exupéry](https://en.wikipedia.org/wiki/The_Little_Prince)",
      "date": "Jan 2025",
      "subject": "Philisophical Fiction",
      "stars": "4",
      "review": "The Little Prince is a philisophical childrens book for adults. It reminds the reader what it was like to think as a child thinks. Through the character The Little Prince the author recounts and regains a child's perspective of the world. As the child recounts his travels and the adults he meets, the reader is reminded of the absurdity of adult life, and what is lost when one grows up; namely, knowing what really matters in life. The books is short but carries an important message that is worth remembering. ",
      "cover": "images/books/tlp.jpeg"
    }, 
    {
      "id": "book3",
      "title": "[The Origins of Totalitarianism by Hannah Arendt](https://en.wikipedia.org/wiki/The_Origins_of_Totalitarianism)",
      "date": "Jan 2025",
      "subject": "Political Philosophy",
      "stars": "3.5",
      "review": "The Origins of Totalitarianism is an extensive and detailed scholarly study of the rise of totalitarianism in the 20th century. The book is divided into three parts: Antisemitism, Imperialism, and Totalitarianism. The first two parts are a heavily researched and referenced account of antisemitism as the catalyst of totalitarian movements and imperialism as a precursor to the expansionist frame of mind upon which totalitarianism depends. The third part covers totalitarianism in power--how it organizes power and how it maintains it. Arendt's key analysis, despite the strong scholarly and historical tone in the first two-thirds, transitions into a more philisophical and speculative nature wherein she hypothesizes that the necessary conditions for totalitarianism are the atomization of individuals and loneliness. I found this an unsatisfying conclusion, as she neglects to mention the role of technology in providing the ability to impose mass surveillance and control. Overall, I would recommend the first two parts of the book as indispensible while the third should be heavily supplemented with more modern resources.",
      "cover": "images/books/toot.jpeg"
    }
    ,
    {
      "id": "book4",
      "title": "[Of Mice and Men by John Steinbeck](https://en.wikipedia.org/wiki/Of_Mice_and_Men)",
      "date": "Jan 2025",
      "subject": "Fiction",
      "stars": "4",
      "review": "A short novel that follows two itinerant workers, George and Lennie, as they seek work on a ranch in Claifornia during the Great Depression. Lennie is a large yet simple-minded man and George is his loyal protector, tasked with keeping Lennie out of trouble. Set in the early 20th century, the novel explores themes of friendship, racism, and the American Dream. Steinbeck is able to craft an imperishably meaningful novel by the use of simple characters and simple country dialect. Yet the depth and complexity of the characters is everywhere apparent and profound. I highly recommend this time-honored classic to anyone looking for a short read that pulls at the heartstrings.",
      "cover": "images/books/omam.jpeg"
    }
  ]